backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_tensor
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 120
      - 120
      - 4
      dtype: float32
      name: input_tensor
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_tensor
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - &id001 !!python/name:numpy.ndarray ''
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - &id002 !!python/object/apply:numpy.dtype
            args:
            - i4
            - 0
            - 1
            state: !!python/tuple
            - 3
            - <
            - null
            - null
            - null
            - -1
            - -1
            - 0
          - false
          - !!binary |
            AAAAAAAAAAAAAAAAAAAAAAEAAAAAAAAAAAAAAAAAAAA=
      dtype: float32
      name: tf_diff2_pady
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
        input:
        - input_tensor
        - tf_diff2_pady/paddings
        name: tf_diff2_pady
        op: Pad
      trainable: true
    inbound_nodes:
    - - - input_tensor
        - 0
        - 0
        - {}
    name: tf_op_layer_tf_diff2_pady
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAAAAAAA
        2: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAD/////
        3: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AQAAAAEAAAABAAAA
      dtype: float32
      name: strided_slice
      node_def:
        attr:
          Index:
            type: DT_INT32
          T:
            type: DT_FLOAT
          begin_mask:
            i: '7'
          ellipsis_mask:
            i: '0'
          end_mask:
            i: '3'
          new_axis_mask:
            i: '0'
          shrink_axis_mask:
            i: '0'
        input:
        - tf_diff2_pady
        - strided_slice/begin
        - strided_slice/end
        - strided_slice/strides
        name: strided_slice
        op: StridedSlice
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_tf_diff2_pady
        - 0
        - 0
        - {}
    name: tf_op_layer_strided_slice
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: Sub
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - input_tensor
        - strided_slice
        name: Sub
        op: Sub
      trainable: true
    inbound_nodes:
    - - - input_tensor
        - 0
        - 0
        - &id003 {}
      - - tf_op_layer_strided_slice
        - 0
        - 0
        - *id003
    name: tf_op_layer_Sub
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: ZerosLike
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Sub
        name: ZerosLike
        op: ZerosLike
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Sub
        - 0
        - 0
        - {}
    name: tf_op_layer_ZerosLike
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAAAAAAA
        2: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAA
        3: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AQAAAAEAAAABAAAA
      dtype: float32
      name: strided_slice_1
      node_def:
        attr:
          Index:
            type: DT_INT32
          T:
            type: DT_FLOAT
          begin_mask:
            i: '7'
          ellipsis_mask:
            i: '0'
          end_mask:
            i: '3'
          new_axis_mask:
            i: '0'
          shrink_axis_mask:
            i: '0'
        input:
        - ZerosLike
        - strided_slice_1/begin
        - strided_slice_1/end
        - strided_slice_1/strides
        name: strided_slice_1
        op: StridedSlice
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_ZerosLike
        - 0
        - 0
        - {}
    name: tf_op_layer_strided_slice_1
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAA
        2: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAAAAAAA
        3: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            AQAAAAEAAAABAAAA
      dtype: float32
      name: strided_slice_2
      node_def:
        attr:
          Index:
            type: DT_INT32
          T:
            type: DT_FLOAT
          begin_mask:
            i: '3'
          ellipsis_mask:
            i: '0'
          end_mask:
            i: '7'
          new_axis_mask:
            i: '0'
          shrink_axis_mask:
            i: '0'
        input:
        - Sub
        - strided_slice_2/begin
        - strided_slice_2/end
        - strided_slice_2/strides
        name: strided_slice_2
        op: StridedSlice
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Sub
        - 0
        - 0
        - {}
    name: tf_op_layer_strided_slice_2
  - class_name: TensorFlowOpLayer
    config:
      constants:
        2: !!python/object/apply:numpy.core.multiarray.scalar
        - *id002
        - !!binary |
          AgAAAA==
      dtype: float32
      name: concat
      node_def:
        attr:
          N:
            i: '2'
          T:
            type: DT_FLOAT
          Tidx:
            type: DT_INT32
        input:
        - strided_slice_1
        - strided_slice_2
        - concat/axis
        name: concat
        op: ConcatV2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_strided_slice_1
        - 0
        - 0
        - &id004 {}
      - - tf_op_layer_strided_slice_2
        - 0
        - 0
        - *id004
    name: tf_op_layer_concat
  - class_name: TensorFlowOpLayer
    config:
      constants:
        2: !!python/object/apply:numpy.core.multiarray.scalar
        - *id002
        - !!binary |
          /////w==
      dtype: float32
      name: tf_diff2_concat
      node_def:
        attr:
          N:
            i: '2'
          T:
            type: DT_FLOAT
          Tidx:
            type: DT_INT32
        input:
        - input_tensor
        - concat
        - tf_diff2_concat/axis
        name: tf_diff2_concat
        op: ConcatV2
      trainable: true
    inbound_nodes:
    - - - input_tensor
        - 0
        - 0
        - &id005 {}
      - - tf_op_layer_concat
        - 0
        - 0
        - *id005
    name: tf_op_layer_tf_diff2_concat
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - tf_diff2_concat
        - MirrorPad/paddings
        name: MirrorPad
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_tf_diff2_concat
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: !!python/tuple
      - 3
      - 3
      name: init_resbk_res1_SN_sn_layer
      scope: init_resbk_res1_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad
        - 0
        - 0
        - {}
    name: init_resbk_res1_SN_sn_layer
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu
      trainable: true
    inbound_nodes:
    - - - init_resbk_res1_SN_sn_layer
        - 0
        - 0
        - {}
    name: elu
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_1
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu/Elu
        - MirrorPad_1/paddings
        name: MirrorPad_1
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_1
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: !!python/tuple
      - 3
      - 3
      name: init_resbk_res2_SN_sn_layer
      scope: init_resbk_res2_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_1
        - 0
        - 0
        - {}
    name: init_resbk_res2_SN_sn_layer
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_1
      padding: same
      pool_size: &id006 !!python/tuple
      - 2
      - 2
      strides: &id007 !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_tf_diff2_concat
        - 0
        - 0
        - {}
    name: average_pooling2d_1
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - init_resbk_res2_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: !!python/tuple
      - 1
      - 1
      name: init_resbk_shortcut_SN_sn_layer
      scope: init_resbk_shortcut_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - average_pooling2d_1
        - 0
        - 0
        - {}
    name: init_resbk_shortcut_SN_sn_layer
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - average_pooling2d/AvgPool
        - init_resbk_shortcut_SN_sn_layer/init_resbk_shortcut_SN_sn_layer/init_resbk_shortcut_SN_conv_in_sn/BiasAdd
        name: AddV2
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - average_pooling2d
        - 0
        - 0
        - &id008 {}
      - - init_resbk_shortcut_SN_sn_layer
        - 0
        - 0
        - *id008
    name: tf_op_layer_AddV2
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_1
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2
        - 0
        - 0
        - {}
    name: elu_1
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_2
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_1/Elu
        - MirrorPad_2/paddings
        name: MirrorPad_2
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_1
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_2
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: &id015 !!python/tuple
      - 3
      - 3
      name: fd_resbk_res1_SN_sn_layer
      scope: fd_resbk_res1_SN
      strides: &id016 !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_2
        - 0
        - 0
        - {}
    name: fd_resbk_res1_SN_sn_layer
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_2
      trainable: true
    inbound_nodes:
    - - - fd_resbk_res1_SN_sn_layer
        - 0
        - 0
        - {}
    name: elu_2
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_3
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_2/Elu
        - MirrorPad_3/paddings
        name: MirrorPad_3
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_2
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_3
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: &id017 !!python/tuple
      - 3
      - 3
      name: fd_resbk_res2_SN_sn_layer
      scope: fd_resbk_res2_SN
      strides: &id018 !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_3
        - 0
        - 0
        - {}
    name: fd_resbk_res2_SN_sn_layer
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: &id019 !!python/tuple
      - 1
      - 1
      name: fd_resbk_shortcut_SN_sn_layer
      scope: fd_resbk_shortcut_SN
      strides: &id020 !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2
        - 0
        - 0
        - {}
    name: fd_resbk_shortcut_SN_sn_layer
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_2
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - fd_resbk_res2_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_2
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_3
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - fd_resbk_shortcut_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_3
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_1
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - average_pooling2d_2/AvgPool
        - average_pooling2d_3/AvgPool
        name: AddV2_1
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_2
        - 0
        - 0
        - &id009 {}
      - - average_pooling2d_3
        - 0
        - 0
        - *id009
    name: tf_op_layer_AddV2_1
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 8
      iteration: 1
      kernel_size: !!python/tuple
      - 1
      - 1
      name: f_attn_conv_SN_sn_layer
      scope: f_attn_conv_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_1
        - 0
        - 0
        - {}
    name: f_attn_conv_SN_sn_layer
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 8
      iteration: 1
      kernel_size: !!python/tuple
      - 1
      - 1
      name: g_attn_conv_SN_sn_layer
      scope: g_attn_conv_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_1
        - 0
        - 0
        - {}
    name: g_attn_conv_SN_sn_layer
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d
      padding: same
      pool_size: !!python/tuple
      - 2
      - 2
      strides: !!python/tuple
      - 2
      - 2
      trainable: true
    inbound_nodes:
    - - - f_attn_conv_SN_sn_layer
        - 0
        - 0
        - {}
    - - - h_attn_conv_SN_sn_layer
        - 0
        - 0
        - {}
    name: max_pooling2d
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            /////4QDAAAIAAAA
      dtype: float32
      name: Reshape_1
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tshape:
            type: DT_INT32
        input:
        - g_attn_conv_SN_sn_layer/g_attn_conv_SN_sn_layer/g_attn_conv_SN_conv_in_sn/BiasAdd
        - Reshape_1/shape
        name: Reshape_1
        op: Reshape
      trainable: true
    inbound_nodes:
    - - - g_attn_conv_SN_sn_layer
        - 0
        - 0
        - {}
    name: tf_op_layer_Reshape_1
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            /////+EAAAAIAAAA
      dtype: float32
      name: Reshape
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tshape:
            type: DT_INT32
        input:
        - max_pooling2d/MaxPool
        - Reshape/shape
        name: Reshape
        op: Reshape
      trainable: true
    inbound_nodes:
    - - - max_pooling2d
        - 0
        - 0
        - {}
    name: tf_op_layer_Reshape
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: BatchMatMulV2
      node_def:
        attr:
          T:
            type: DT_FLOAT
          adj_x:
            b: false
          adj_y:
            b: true
        input:
        - Reshape_1
        - Reshape
        name: BatchMatMulV2
        op: BatchMatMulV2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Reshape_1
        - 0
        - 0
        - &id010 {}
      - - tf_op_layer_Reshape
        - 0
        - 0
        - *id010
    name: tf_op_layer_BatchMatMulV2
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id002
        - !!binary |
          /////w==
      dtype: float32
      name: Max
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tidx:
            type: DT_INT32
          keep_dims:
            b: true
        input:
        - BatchMatMulV2
        - Max/reduction_indices
        name: Max
        op: Max
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_BatchMatMulV2
        - 0
        - 0
        - {}
    name: tf_op_layer_Max
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: Sub_1
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - BatchMatMulV2
        - Max
        name: Sub_1
        op: Sub
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_BatchMatMulV2
        - 0
        - 0
        - &id011 {}
      - - tf_op_layer_Max
        - 0
        - 0
        - *id011
    name: tf_op_layer_Sub_1
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: Exp
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Sub_1
        name: Exp
        op: Exp
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Sub_1
        - 0
        - 0
        - {}
    name: tf_op_layer_Exp
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 32
      iteration: 1
      kernel_size: !!python/tuple
      - 1
      - 1
      name: h_attn_conv_SN_sn_layer
      scope: h_attn_conv_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_1
        - 0
        - 0
        - {}
    name: h_attn_conv_SN_sn_layer
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id002
        - !!binary |
          /////w==
      dtype: float32
      name: Sum
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tidx:
            type: DT_INT32
          keep_dims:
            b: true
        input:
        - Exp
        - Sum/reduction_indices
        name: Sum
        op: Sum
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Exp
        - 0
        - 0
        - {}
    name: tf_op_layer_Sum
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: RealDiv
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Exp
        - Sum
        name: RealDiv
        op: RealDiv
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Exp
        - 0
        - 0
        - &id012 {}
      - - tf_op_layer_Sum
        - 0
        - 0
        - *id012
    name: tf_op_layer_RealDiv
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 3
          - *id002
          - false
          - !!binary |
            /////+EAAAAgAAAA
      dtype: float32
      name: Reshape_2
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tshape:
            type: DT_INT32
        input:
        - max_pooling2d/MaxPool_1
        - Reshape_2/shape
        name: Reshape_2
        op: Reshape
      trainable: true
    inbound_nodes:
    - - - max_pooling2d
        - 1
        - 0
        - {}
    name: tf_op_layer_Reshape_2
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: BatchMatMulV2_1
      node_def:
        attr:
          T:
            type: DT_FLOAT
          adj_x:
            b: false
          adj_y:
            b: false
        input:
        - RealDiv
        - Reshape_2
        name: BatchMatMulV2_1
        op: BatchMatMulV2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_RealDiv
        - 0
        - 0
        - &id013 {}
      - - tf_op_layer_Reshape_2
        - 0
        - 0
        - *id013
    name: tf_op_layer_BatchMatMulV2_1
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
          - *id002
          - false
          - !!binary |
            /////x4AAAAeAAAAIAAAAA==
      dtype: float32
      name: Reshape_3
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tshape:
            type: DT_INT32
        input:
        - BatchMatMulV2_1
        - Reshape_3/shape
        name: Reshape_3
        op: Reshape
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_BatchMatMulV2_1
        - 0
        - 0
        - {}
    name: tf_op_layer_Reshape_3
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: !!python/tuple
      - 1
      - 1
      name: out_attn_conv_SN_sn_layer
      scope: out_attn_conv_SN
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_Reshape_3
        - 0
        - 0
        - {}
    name: out_attn_conv_SN_sn_layer
  - class_name: TensorFlowOpLayer
    config:
      constants:
        0: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 1
          - &id024 !!python/object/apply:numpy.dtype
            args:
            - f4
            - 0
            - 1
            state: !!python/tuple
            - 3
            - <
            - null
            - null
            - null
            - -1
            - -1
            - 0
          - false
          - !!binary |
            AAAAAA==
      dtype: float32
      name: Mul
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Mul/x
        - out_attn_conv_SN_sn_layer/out_attn_conv_SN_sn_layer/out_attn_conv_SN_conv_in_sn/BiasAdd
        name: Mul
        op: Mul
      trainable: true
    inbound_nodes:
    - - - out_attn_conv_SN_sn_layer
        - 0
        - 0
        - {}
    name: tf_op_layer_Mul
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_2
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Mul
        - AddV2_1
        name: AddV2_2
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Mul
        - 0
        - 0
        - &id014 {}
      - - tf_op_layer_AddV2_1
        - 0
        - 0
        - *id014
    name: tf_op_layer_AddV2_2
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_3
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_2
        - 0
        - 0
        - {}
    name: elu_3
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_4
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_3/Elu
        - MirrorPad_4/paddings
        name: MirrorPad_4
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_3
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_4
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id015
      name: md_resbk_0_res1_SN_sn_layer
      scope: md_resbk_0_res1_SN
      strides: *id016
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_4
        - 0
        - 0
        - {}
    name: md_resbk_0_res1_SN_sn_layer
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_4
      trainable: true
    inbound_nodes:
    - - - md_resbk_0_res1_SN_sn_layer
        - 0
        - 0
        - {}
    name: elu_4
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_5
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_4/Elu
        - MirrorPad_5/paddings
        name: MirrorPad_5
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_4
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_5
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id017
      name: md_resbk_0_res2_SN_sn_layer
      scope: md_resbk_0_res2_SN
      strides: *id018
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_5
        - 0
        - 0
        - {}
    name: md_resbk_0_res2_SN_sn_layer
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id019
      name: md_resbk_0_shortcut_SN_sn_layer
      scope: md_resbk_0_shortcut_SN
      strides: *id020
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_2
        - 0
        - 0
        - {}
    name: md_resbk_0_shortcut_SN_sn_layer
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_4
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - md_resbk_0_res2_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_4
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_5
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - md_resbk_0_shortcut_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_5
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_3
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - average_pooling2d_4/AvgPool
        - average_pooling2d_5/AvgPool
        name: AddV2_3
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_4
        - 0
        - 0
        - &id021 {}
      - - average_pooling2d_5
        - 0
        - 0
        - *id021
    name: tf_op_layer_AddV2_3
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_5
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_3
        - 0
        - 0
        - {}
    name: elu_5
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_6
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_5/Elu
        - MirrorPad_6/paddings
        name: MirrorPad_6
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_5
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_6
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id015
      name: md_resbk_1_res1_SN_sn_layer
      scope: md_resbk_1_res1_SN
      strides: *id016
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_6
        - 0
        - 0
        - {}
    name: md_resbk_1_res1_SN_sn_layer
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_6
      trainable: true
    inbound_nodes:
    - - - md_resbk_1_res1_SN_sn_layer
        - 0
        - 0
        - {}
    name: elu_6
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_7
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_6/Elu
        - MirrorPad_7/paddings
        name: MirrorPad_7
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_6
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_7
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id017
      name: md_resbk_1_res2_SN_sn_layer
      scope: md_resbk_1_res2_SN
      strides: *id018
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_7
        - 0
        - 0
        - {}
    name: md_resbk_1_res2_SN_sn_layer
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id019
      name: md_resbk_1_shortcut_SN_sn_layer
      scope: md_resbk_1_shortcut_SN
      strides: *id020
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_3
        - 0
        - 0
        - {}
    name: md_resbk_1_shortcut_SN_sn_layer
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_6
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - md_resbk_1_res2_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_6
  - class_name: AveragePooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: average_pooling2d_7
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - md_resbk_1_shortcut_SN_sn_layer
        - 0
        - 0
        - {}
    name: average_pooling2d_7
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_4
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - average_pooling2d_6/AvgPool
        - average_pooling2d_7/AvgPool
        name: AddV2_4
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - average_pooling2d_6
        - 0
        - 0
        - &id022 {}
      - - average_pooling2d_7
        - 0
        - 0
        - *id022
    name: tf_op_layer_AddV2_4
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_7
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_4
        - 0
        - 0
        - {}
    name: elu_7
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_8
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_7/Elu
        - MirrorPad_8/paddings
        name: MirrorPad_8
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_7
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_8
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id015
      name: md_resbk_2_res1_SN_sn_layer
      scope: md_resbk_2_res1_SN
      strides: *id016
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_8
        - 0
        - 0
        - {}
    name: md_resbk_2_res1_SN_sn_layer
  - class_name: ELU
    config:
      alpha: 1.0
      dtype: float32
      name: elu_8
      trainable: true
    inbound_nodes:
    - - - md_resbk_2_res1_SN_sn_layer
        - 0
        - 0
        - {}
    name: elu_8
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 4
            - 2
          - *id002
          - false
          - !!binary |
            AAAAAAAAAAABAAAAAQAAAAEAAAABAAAAAAAAAAAAAAA=
      dtype: float32
      name: MirrorPad_9
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tpaddings:
            type: DT_INT32
          mode:
            s: UkVGTEVDVA==
        input:
        - elu_8/Elu
        - MirrorPad_9/paddings
        name: MirrorPad_9
        op: MirrorPad
      trainable: true
    inbound_nodes:
    - - - elu_8
        - 0
        - 0
        - {}
    name: tf_op_layer_MirrorPad_9
  - class_name: ConvSN2D
    config:
      dtype: float32
      eps: 1.0e-12
      filters: 64
      iteration: 1
      kernel_size: *id017
      name: md_resbk_2_res2_SN_sn_layer
      scope: md_resbk_2_res2_SN
      strides: *id018
      trainable: true
      training: true
    inbound_nodes:
    - - - tf_op_layer_MirrorPad_9
        - 0
        - 0
        - {}
    name: md_resbk_2_res2_SN_sn_layer
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_5
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - md_resbk_2_res2_SN_sn_layer/md_resbk_2_res2_SN_sn_layer/md_resbk_2_res2_SN_conv_in_sn/BiasAdd
        - AddV2_4
        name: AddV2_5
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - md_resbk_2_res2_SN_sn_layer
        - 0
        - 0
        - &id023 {}
      - - tf_op_layer_AddV2_4
        - 0
        - 0
        - *id023
    name: tf_op_layer_AddV2_5
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray._reconstruct
          args:
          - *id001
          - !!python/tuple
            - 0
          - !!binary |
            Yg==
          state: !!python/tuple
          - 1
          - !!python/tuple
            - 2
          - *id002
          - false
          - !!binary |
            /////wAQAAA=
      dtype: float32
      name: Reshape_4
      node_def:
        attr:
          T:
            type: DT_FLOAT
          Tshape:
            type: DT_INT32
        input:
        - AddV2_5
        - Reshape_4/shape
        name: Reshape_4
        op: Reshape
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_5
        - 0
        - 0
        - {}
    name: tf_op_layer_Reshape_4
  - class_name: Dense
    config:
      activation: elu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: mdl_nn_mlp_o1
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - tf_op_layer_Reshape_4
        - 0
        - 0
        - {}
    name: mdl_nn_mlp_o1
  - class_name: Dense
    config:
      activation: elu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: mdl_nn_mlp_o2
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - mdl_nn_mlp_o1
        - 0
        - 0
        - {}
    name: mdl_nn_mlp_o2
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id024
        - !!binary |
          AACAPg==
      dtype: float32
      name: Mul_2
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - mdl_nn_mlp_o2/Elu
        - Mul_2/y
        name: Mul_2
        op: Mul
      trainable: true
    inbound_nodes:
    - - - mdl_nn_mlp_o2
        - 0
        - 0
        - {}
    name: tf_op_layer_Mul_2
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_6
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - mdl_nn_mlp_o1/Elu
        - Mul_2
        name: AddV2_6
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - mdl_nn_mlp_o1
        - 0
        - 0
        - &id025 {}
      - - tf_op_layer_Mul_2
        - 0
        - 0
        - *id025
    name: tf_op_layer_AddV2_6
  - class_name: Dense
    config:
      activation: elu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: mdl_nn_mlp_o3
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_6
        - 0
        - 0
        - {}
    name: mdl_nn_mlp_o3
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id024
        - !!binary |
          AACAPg==
      dtype: float32
      name: Mul_3
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - AddV2_6
        - Mul_3/y
        name: Mul_3
        op: Mul
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_6
        - 0
        - 0
        - {}
    name: tf_op_layer_Mul_3
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: AddV2_7
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - mdl_nn_mlp_o3/Elu
        - Mul_3
        name: AddV2_7
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - mdl_nn_mlp_o3
        - 0
        - 0
        - &id026 {}
      - - tf_op_layer_Mul_3
        - 0
        - 0
        - *id026
    name: tf_op_layer_AddV2_7
  - class_name: Dense
    config:
      activation: elu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: mdl_nn_mlp_of2
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - tf_op_layer_AddV2_7
        - 0
        - 0
        - {}
    name: mdl_nn_mlp_of2
  - class_name: Dense
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: mdl_nn_mlp_of3
      trainable: true
      units: 52
      use_bias: true
    inbound_nodes:
    - - - mdl_nn_mlp_of2
        - 0
        - 0
        - {}
    name: mdl_nn_mlp_of3
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id024
        - !!binary |
          AACMQg==
      dtype: float32
      name: Mul_4
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - mdl_nn_mlp_of3/Tanh
        - Mul_4/y
        name: Mul_4
        op: Mul
      trainable: true
    inbound_nodes:
    - - - mdl_nn_mlp_of3
        - 0
        - 0
        - {}
    name: tf_op_layer_Mul_4
  - class_name: TensorFlowOpLayer
    config:
      constants:
        1: !!python/object/apply:numpy.core.multiarray.scalar
        - *id024
        - !!binary |
          AABIQg==
      dtype: float32
      name: AddV2_8
      node_def:
        attr:
          T:
            type: DT_FLOAT
        input:
        - Mul_4
        - AddV2_8/y
        name: AddV2_8
        op: AddV2
      trainable: true
    inbound_nodes:
    - - - tf_op_layer_Mul_4
        - 0
        - 0
