backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_1
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 1000
      - 178
      dtype: float32
      name: input_1
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: LayerNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 2
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      name: layer_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: layer_normalization
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          dtype: float32
          go_backwards: false
          implementation: 2
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: lstm
          recurrent_activation: sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config:
              gain: 1.0
              seed: null
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unit_forget_bias: true
          units: 25
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional
      trainable: true
    inbound_nodes:
    - - - layer_normalization
        - 0
        - 0
        - {}
    name: bidirectional
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          dtype: float32
          go_backwards: false
          implementation: 2
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: lstm_1
          recurrent_activation: sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config:
              gain: 1.0
              seed: null
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unit_forget_bias: true
          units: 25
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_1
      trainable: true
    inbound_nodes:
    - - - bidirectional
        - 0
        - 0
        - {}
    name: bidirectional_1
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - {}
    name: flatten
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 1000
      use_bias: true
    inbound_nodes:
    - - - flatten
        - 0
        - 0
        - {}
    name: dense
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 1000
      use_bias: true
    inbound_nodes:
    - - - flatten
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: TensorFlowOpLayer
    config:
      constants: {}
      dtype: float32
      name: stack
      node_def:
        attr:
          N:
            i: '2'
          T:
            type: DT_FLOAT
          axis:
            i: '2'
        input:
        - dense/Sigmoid
        - dense_1/Sigmoid
        name: stack
        op: Pack
      trainable: true
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - &id001 {}
      - - dense_1
        - 0
        - 0
        - *id001
    name: tf_op_layer_stack
  name: functional_1
  output_layers:
  - - tf_op_layer_stack
    - 0
    - 0
keras_version: 2.4.0
