backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - input_score_48
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 128
      - 384
      - 1
      dtype: float32
      name: input_score_48
      ragged: false
      sparse: false
    inbound_nodes: []
    name: input_score_48
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 7
      - 7
      name: conv2d
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_score_48
        - 0
        - 0
        - {}
    name: conv2d
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation
      trainable: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: activation
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation
        - 0
        - 0
        - {}
    name: batch_normalization
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization
        - 0
        - 0
        - {}
    name: dropout
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id001 !!python/tuple
      - 3
      - 3
      name: conv2d_1
      padding: same
      strides: &id003 !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id001
      name: conv2d_2
      padding: same
      strides: &id006 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple
      - 1
      - 1
      name: conv2d_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: Add
    config:
      dtype: float32
      name: add
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - &id004 {}
      - - conv2d_3
        - 0
        - 0
        - *id004
    name: add
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - add
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_2
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id005 !!python/tuple
      - 3
      - 3
      name: conv2d_4
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_3
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id005
      name: conv2d_5
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Add
    config:
      dtype: float32
      name: add_1
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - &id007 {}
      - - add
        - 0
        - 0
        - *id007
    name: add_1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_4
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id008 !!python/tuple
      - 3
      - 3
      name: conv2d_6
      padding: same
      strides: &id010 !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_5
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id008
      name: conv2d_7
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id009
      name: conv2d_8
      padding: same
      strides: *id010
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Add
    config:
      dtype: float32
      name: add_2
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - &id011 {}
      - - conv2d_8
        - 0
        - 0
        - *id011
    name: add_2
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_6
      trainable: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_6
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id012 !!python/tuple
      - 3
      - 3
      name: conv2d_9
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_7
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_7
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id012
      name: conv2d_10
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: Add
    config:
      dtype: float32
      name: add_3
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - &id013 {}
      - - add_2
        - 0
        - 0
        - *id013
    name: add_3
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_8
      trainable: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_8
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id014 !!python/tuple
      - 3
      - 3
      name: conv2d_11
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_9
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_9
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: dropout_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id014
      name: conv2d_12
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_9
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: Add
    config:
      dtype: float32
      name: add_4
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - &id015 {}
      - - add_3
        - 0
        - 0
        - *id015
    name: add_4
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_10
      trainable: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_10
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: dropout_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id016 !!python/tuple
      - 3
      - 3
      name: conv2d_13
      padding: same
      strides: &id017 !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_10
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_11
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_11
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: dropout_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id016
      name: conv2d_14
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_11
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id009
      name: conv2d_15
      padding: same
      strides: *id017
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Add
    config:
      dtype: float32
      name: add_5
      trainable: true
    inbound_nodes:
    - - - conv2d_14
        - 0
        - 0
        - &id018 {}
      - - conv2d_15
        - 0
        - 0
        - *id018
    name: add_5
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_12
      trainable: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_12
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: dropout_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id019 !!python/tuple
      - 3
      - 3
      name: conv2d_16
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_12
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_13
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_13
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - {}
    name: batch_normalization_13
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_13
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_13
        - 0
        - 0
        - {}
    name: dropout_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id019
      name: conv2d_17
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_13
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: Add
    config:
      dtype: float32
      name: add_6
      trainable: true
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - &id020 {}
      - - add_5
        - 0
        - 0
        - *id020
    name: add_6
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_14
      trainable: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_14
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: batch_normalization_14
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_14
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_14
        - 0
        - 0
        - {}
    name: dropout_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id021 !!python/tuple
      - 3
      - 3
      name: conv2d_18
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_14
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_15
      trainable: true
    inbound_nodes:
    - - - conv2d_18
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_15
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - {}
    name: batch_normalization_15
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_15
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_15
        - 0
        - 0
        - {}
    name: dropout_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id021
      name: conv2d_19
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_15
        - 0
        - 0
        - {}
    name: conv2d_19
  - class_name: Add
    config:
      dtype: float32
      name: add_7
      trainable: true
    inbound_nodes:
    - - - conv2d_19
        - 0
        - 0
        - &id022 {}
      - - add_6
        - 0
        - 0
        - *id022
    name: add_7
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_16
      trainable: true
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_16
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - {}
    name: batch_normalization_16
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_16
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_16
        - 0
        - 0
        - {}
    name: dropout_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id023 !!python/tuple
      - 3
      - 3
      name: conv2d_20
      padding: same
      strides: !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_16
        - 0
        - 0
        - {}
    name: conv2d_20
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_17
      trainable: true
    inbound_nodes:
    - - - conv2d_20
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_17
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - {}
    name: batch_normalization_17
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_17
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_17
        - 0
        - 0
        - {}
    name: dropout_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 128
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id023
      name: conv2d_21
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_17
        - 0
        - 0
        - {}
    name: conv2d_21
  - class_name: Add
    config:
      dtype: float32
      name: add_8
      trainable: true
    inbound_nodes:
    - - - conv2d_21
        - 0
        - 0
        - &id024 {}
      - - add_7
        - 0
        - 0
        - *id024
    name: add_8
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_18
      trainable: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: activation_18
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_18
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_18
        - 0
        - 0
        - {}
    name: batch_normalization_18
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_18
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_18
        - 0
        - 0
        - {}
    name: dropout_18
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: &id025 !!python/tuple
      - 3
      - 3
      name: conv2d_22
      padding: same
      strides: &id026 !!python/tuple
      - 2
      - 2
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_18
        - 0
        - 0
        - {}
    name: conv2d_22
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_19
      trainable: true
    inbound_nodes:
    - - - conv2d_22
        - 0
        - 0
        - {}
    name: activation_19
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_19
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: batch_normalization_19
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_19
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - batch_normalization_19
        - 0
        - 0
        - {}
    name: dropout_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id025
      name: conv2d_23
      padding: same
      strides: *id006
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_19
        - 0
        - 0
        - {}
    name: conv2d_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      dtype: float32
      filters: 256
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: *id009
      name: conv2d_24
      padding: same
      strides: *id026
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: conv2d_24
  - class_name: Add
    config:
      dtype: float32
      name: add_9
      trainable: true
    inbound_nodes:
    - - - conv2d_23
        - 0
        - 0
        - &id027 {}
      - - conv2d_24
        - 0
        - 0
        - *id027
    name: add_9
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_20
      trainable: true
    inbound_nodes:
    - - - add_9
        - 0
        - 0
        - {}
    name: activation_20
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_20
      scale: true
      trainable: true
    inbound_nodes:
    - - - activation_20
        - 0
        - 0
        - {}
    name: batch_normalization_20
  - class_name: Dropout
    config:
      dtype: float32
